/* Translation.strings\n    SAPTracker\n  \n    Created by Raimund Wege on 27.07.16.\n    Copyright © 2016 com.sap.sailing. All rights reserved.\n  \n\n   MARK: - Common */
"Common.Cancel" = "Cancelar";

"Common.OK" = "OK";

"Common.Info" = "Info";

"Common.Warning" = "Advertência";

"Common.Error" = "Erro";

"Common.Yes" = "Sim";

"Common.No" = "Não";

"Common.Settings" = "Configurações";

"Common.Logout" = "Logoff";

/* MARK: - Endpoint */
"Endpoint.Training" = "https://ubilabstest.sapsailing.com";

/* MARK: - RegattaCheckInController */
"RegattaCheckInController.WelcomeAlert.Title" = "Oi %@";

"RegattaCheckInController.WelcomeAlert.Message" = "Você está efetuando o logon como %@.";

"RegattaCheckInController.WelcomeAlert.CancelAction.Title" = "Não sou eu!";

/* MARK: - GPSFixController */
"GPSFixController.Mode" = "Modo";

"GPSFixController.Mode.Error" = "Erro de API";

"GPSFixController.Mode.BatterySaving" = "Poupança de bateria";

"GPSFixController.Mode.None" = "-";

"GPSFixController.Mode.Online" = "Online";

"GPSFixController.Mode.Offline" = "Offline";

/* MARK: - LocationManager */
"LocationManager.LocationServicesDeniedError" = "O GPS está desativado para este app, mas o rastreamento requer posições de GPS. Você pretende ativar o GPS nas configurações da localização?";

"LocationManager.LocationServicesDisabledError" = "O GPS está desativado, mas o rastreamento requer posições de GPS. Você pretende ativar o GPS nas configurações da localização?";

"LocationManager.Status" = "Status";

"LocationManager.Status.Tracking" = "Rastreamento";

"LocationManager.Status.NotTracking" = "Nenhum sinal de GPS!";

/* MARK: - CheckInDataCollectorError */
"CheckInDataCollectorError.CheckInDataIsIncomplete" = "Nenhum ID de competidor ou marca encontrado no código QR.";

/* MARK: - CheckInRequestManagerError */
"CheckInRequestManagerError.CommunicationFailed" = "Não foi possível concluir operação no servidor. Tente novamente.";

"CheckInRequestManagerError.GetBoatFailed" = "Não foi possível obter barco.";

"CheckInRequestManagerError.GetCompetitorFailed" = "Não foi possível obter competidor.";

"CheckInRequestManagerError.GetEventFailed" = "Não foi possível obter evento.";

"CheckInRequestManagerError.GetLeaderboardFailed" = "Não foi possível obter painel de classificação.";

"CheckInRequestManagerError.GetMarkFailed" = "Não foi possível obter marca.";

"CheckInRequestManagerError.GetTeamFailed" = "Não foi possível obter equipe.";

"CheckInRequestManagerError.PostCheckInFailed" = "Check-in falhou.";

"CheckInRequestManagerError.PostCheckOutFailed" = "Check-out falhou.";

"CheckInRequestManagerError.PostGPSFixFailed" = "Não foi possível enviar posições de GPS.";

"CheckInRequestManagerError.PostTeamImageFailed" = "Não foi possível carregar imagem da equipe.";

"CheckInRequestManagerError.TeamImageURLIsInvalid" = "O URL da imagem da equipe é inválido.";

/* MARK: - StartView */
"StartView.RegattaButton.Title" = "Regatas";

"StartView.TrainingButton.Title" = "Treinamento individual";

/* MARK: - AboutView */
"AboutView.Title" = "Sobre este app";

"AboutView.PartnershipTextView.Text" = "O app SAP Sail InSight suporta o rastreamento ao vivo de barcos de regata, tirando partido da tecnologia dos celulares, permitindo que amigos e fãs sigam a regata no local ou online com painéis de classificação ao vivo e visualização 2D. Subsequentemente, os velejadores podem reproduzir suas regatas, tendo oportunidade de revisar o desempenho e otimizar as estratégias, tudo disponível em: https://www.sapsailing.com\n\nA SAP suporta a US Sailing com a implementação de uma variedade de soluções de tecnologia inovadoras, fornecendo análises para ajudar equipes e velejadores a melhorar o desempenho ao mesmo tempo que fornecem aplicativos que ajudam a que as operações de navegação sejam executadas de forma mais eficiente.\n\nComo o grupo dirigente nacional da navegação a vela, a US Sailing fornece liderança, integridade e crescimento ao esporte, incluindo programas de treinamento e formação para instrutores e oficiais da regata juntamente com administração e supervisão da navegação compettiva a vela no país.";

"AboutView.TermsButton.Title" = "EULA";

"AboutView.VersionTitleLabel.Text" = "Versão";

/* MARK: - CourseView */
"CourseView.TitleLabel.Text" = "Percurso no fundo";

/* MARK: - RegattaCheckInListView */
"RegattaCheckInListView.Title" = "Regatas";

"RegattaCheckInListView.HeaderTitleLabel.Text" = "Suas regatas:";

"RegattaCheckInListView.FooterTextView.Text" = "Mais informações em\nhttps://sapsailing.com";

"RegattaCheckInListView.InfoCodeLabel.Text" = "O código QR pode ser encontrado na sua confirmação de participação.";

"RegattaCheckInListView.TermsAlert.Title" = "EULA";

"RegattaCheckInListView.TermsAlert.Message" = "Ao utilizar este app, você confirma ter aceito o contrato de licença do usuário final da SAP SE. Leia este EULA aqui.";

"RegattaCheckInListView.TermsAlert.ShowTermsAction.Title" = "EULA";

"RegattaCheckInListView.TermsAlert.AcceptTermsAction.Title" = "Confirmar";

"RegattaCheckInListView.NoCameraAlert.Message" = "O dispositivo não tem câmera.";

"RegattaCheckInListView.NoCodeAlert.Title" = "Não tem um código QR?";

"RegattaCheckInListView.NoCodeAlert.Message" = "Entre em contato com a administração da corrida se você não tiver recebido um código QR.";

/* MARK: - TrainingCheckInListView */
"TrainingCheckInListView.Title" = "Treinamentos";

"TrainingCheckInListView.HeaderTitleLabel.Text" = "Seus treinamentos:";

"TrainingCheckInListView.FooterTextView.Text" = "Para administrar suas sessões de treinamento, crie pelo menos um treinamento utilizando o botão Mais.";

/* MARK: - TrainingView */
"TrainingView.LeaderboardButton.Title" = "Analisar";

"TrainingView.OptionSheet.CheckOutAction.Title" = "Remover treinamento";

"TrainingView.FinishButton.Title" = "Concluir";

"TrainingView.ReactivateAlert.Title" = "Reativar treinamento";

"TrainingView.ReactivateAlert.Message" = "Esta sessão de treinamento foi concluída. Você pretende realmente continuar e reativar esta sessão?";

"TrainingView.ReactivatedAlert.Title" = "A sessão de treinamento está agora ativa.";

"TrainingView.FinishAlert.Title" = "Concluir treinamento";

"TrainingView.FinishAlert.Message" = "Você gostaria de concluir esta sessão de treinamento?";

"TrainingView.FinishedAlert.Title" = "A sessão de treinamento foi concluída com êxito.";

"TrainingView.CheckOutAlert.Message" = "Você pretende REALMENTE remover esta sessão de treinamento do seu dispositivo?";

/* MARK: - CreateTrainingView */
"CreateTrainingView.Title" = "Criar treinamento";

"CreateTrainingView.BoatClassNameLabel.Text" = "Classe de barcos";

"CreateTrainingView.CreateTrainingButton.Title" = "Criar treinamento";

/* MARK: - LeaderboardView */
"LeaderboardView.Title" = "Painel de classificação";

/* MARK: - LicenseView */
"LicenseView.Title" = "Informações sobre a licença";

/* MARK: - RegattaView */
"RegattaView.CountdownDaysTitleLabel.Text" = "Dias";

"RegattaView.CountdownHoursTitleLabel.Text" = "Horas";

"RegattaView.CountdownMinutesTitleLabel.Text" = "Minutos";

"RegattaView.StartLabel.Text.BeforeRegattaDidStart" = "A regata começa em:";

"RegattaView.StartLabel.Text.AfterRegattaDidStart" = "A regata está em curso.";

"RegattaView.AnnouncementLabel.Text" = "Ouça os anúncios.";

"RegattaView.EventButton.Title" = "Evento";

"RegattaView.StartTrackingButton.Title" = "Iniciar rastreamento";

"RegattaView.OptionSheet.CheckOutAction.Title" = "Check-out";

"RegattaView.CheckOutAlert.Message" = "Você pretende REALMENTE efetuar o logoff? será necessário efetuar um novo logon com o código QR fornecido para acessar sua regata!";

/* MARK: - CompetitorView */
"CompetitorView.SelectImageAlert.Title" = "Foto";

"CompetitorView.SelectImageAlert.Message" = "Você pretende utilizar uma imagem existente ou tirar uma nova?";

"CompetitorView.SelectImageAlert.CameraAction.Title" = "Tirar foto";

"CompetitorView.SelectImageAlert.PhotoLibraryAction.Title" = "Existente";

"CompetitorView.TeamImageUploadRetryButton.Title" = "Erro ao carregar.\nTocar para repetir.";

"CompetitorView.TeamImageAddButton.Title" = "Adicionar foto da equipe";

"CompetitorView.UploadTeamImageFailureAlert.Title" = "Erro ao carregar imagem";

/* MARK: - ScanView */
"ScanView.Title" = "Digitalizar código QR";

"ScanView.IncorrectCodeAlert.Message" = "Código QR inválido";

/* MARK: - SpeedView */
"SpeedView.TitleLabel.Text" = "Velocidade no fundo";

/* MARK: - SettingsView */
"SettingsView.Title" = "Configurações";

"SettingsView.TableView.BatterySavingSection.Title" = "Poupança de bateria";

"SettingsView.TableView.DeviceSection.Title" = "Informação do dispositivo";

"SettingsView.TableView.TrainingSection.Title" = "Área de treinamento";

"SettingsView.BatterySavingTitleLabel.Text" = "Poupar energia";

"SettingsView.BatterySavingDescriptionLabel.Text" = "As atualizações do GPS estão sendo enviadas ao servidor a cada %0.0f segundos.";

"SettingsView.DeviceIdentifierTitleLabel.Text" = "Identificador do dispositivo";

"SettingsView.TrainingServerTitleLabel.Text" = "Ponto de acesso do servidor";

/* MARK: - TimerView */
"TimerView.TitleLabel.Text" = "Tempo de rastreamento";

/* MARK: - TrackingView */
"TrackingView.TableView.GPSFixesCell.GPSFixesTitleLabel.Text" = "Pontos fixos não enviados";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyTitleLabel.Text" = "Precisão de GPS";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyLabel.Text.NoGPS" = "nenhum GPS";

"TrackingView.StopTrackingButton.Title" = "Parar rastreamento";

"TrackingView.StopTrackingAlert.Title" = "Confirmar";

"TrackingView.StopTrackingAlert.Message" = "Você quer realmente parar o rastreamento?";

